app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts"
---
    def index
      carts = Cart.all

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 3], ["updated_at", "2023-04-01 09:50:52.743698"], ["id", 2]]
---
    def update
        cart_item = CartItem.find(params[:cart][:cart_items][0][:id])
        if cart_item.update(quantity: params[:cart][:cart_items][0][:quantity])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."food_id" = ? LIMIT ?  [["cart_id", 7], ["food_id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2023-04-02 14:24:24.797047"], ["id", 6]]
---
    def add_item
        cart = Cart.find(params[:cart_id])
        food = Food.find(params[:food_id])
        cart_item = cart.cart_items.find_or_initialize_by(food: food)
        cart_item.quantity ||= 0
        cart_item.quantity += 1

        if cart_item.save

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."food_id" = ? LIMIT ?  [["cart_id", 7], ["food_id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 7]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 6]]
---
    def remove_item
        cart_item = CartItem.find_by(cart_id: params[:cart_id], food_id: params[:food_id])

        if cart_item.present?
          cart_item.destroy

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_cart
      cart = Cart.find(params[:cart_id] || params[:id])