app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
    def index
        foods = Food.all

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        food = Food.find(params[:id])