app/controllers/orders_controller.rb

    def index
      orders = Order.all
---
SELECT "orders".* FROM "orders"

    def show
      order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      order = Order.create(order_params)
---
INSERT INTO "orders" ("status", "total_price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["status", nil], ["total_price", nil], ["user_id", 1], ["created_at", "2023-04-01 10:08:26.983023"], ["updated_at", "2023-04-01 10:08:26.983023"]]

    def checkout
        order = Order.find(params[:id])
        if order.status == 'pending'
          order.update(status: 'checked_out')
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "checked_out"], ["updated_at", "2023-04-01 10:26:55.210069"], ["id", 1]]