app/controllers/users_controller.rb

    def show
        user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "zaki12"], ["email", "zaki@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-01 11:28:04.640025"], ["updated_at", "2023-04-01 11:28:04.640025"]]

    def change_password
        user = User.find(params[:id])
        if user && user.authenticate(params[:current_password])
            user.update(password: params[:new_password])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-04-01 11:30:19.289021"], ["id", 11]]